:PROPERTIES:
:ID:       0617c544-0d04-4a55-9d70-b8b4998fad92
:END:
#+title: Solutions to SUSE Cloud native fundamentals scholarship exercises
#+date: "2021-06-08 23:23:35 +08:00"
#+date_modified: "2021-07-07 16:33:05 +08:00"
#+language: en


I'll attempt to archive my answers to exercise here in one Org mode document.
Let's see the reproducibility capability of this thing.

For future references, the lessons have their repo.

- [[https://github.com/udacity/nd064_course_1][Lesson 1 exercises]]




** Solution

For the prerequisites, you can just install Flask and you're mostly done.
For future references, here are the version of the tools I've used at the time.

#+begin_src bash  :cache yes
nix-shell -p 'python3Packages.flask' entr --run 'flask --version'
#+end_src

#+results[4674aa09a83cfbedff7e8991ba81b077dd0483d3]:
: Python 3.8.9
: Flask 1.1.2
: Werkzeug 1.0.1

As for the solution:

#+begin_src python  :tangle (my/concat-assets-folder "python-helloworld-app.py")
from flask import Flask
app = Flask(__name__)

@app.route("/")
def hello():
    return "Hello World!"

@app.route("/status")
def health_check():
    return { "result": "OK - healthy" }

@app.route("/metrics")
def metrics():
    return { "data": { "UserCount": 140, "UserCountActive": 23} }

if __name__ == "__main__":
    app.run(host='0.0.0.0')
#+end_src


